src/Iterator/readme.md
``` mermaid 
classDiagram
    class Trabalhador {
        - String nome
        + imprimir()
    }

    class ListaTrabalhadores {
        - List~Trabalhador~ trabalhadores
        + adicionar(Trabalhador)
        + obter(int): Trabalhador
        + contar(): int
        + imprimirTodos()
    }

    class Main {
        + main(String[])
    }

    Main --> ListaTrabalhadores : usa
    ListaTrabalhadores --> Trabalhador : contém

```
